//
//  UserZYListCtl.m
//  jobClient
//
//  Created by YL1001 on 14-8-13.
//  Copyright (c) 2014年 YL1001. All rights reserved.
//

#import "UserZYListCtl.h"

@interface UserZYListCtl ()
{
    NSArray * objectArr_;
    
    NSArray * object1Arr_;
    
    NSArray * object2Arr_;
    
    NSArray * zyArr_;
    
    
}

@end

@implementation UserZYListCtl
@synthesize delegate_,type_,index_,index2_;
-(id)init
{
    self = [super init];
    
    bHeaderEgo_ = NO;
   
    return self;
}


-(void)createArr
{
    NSArray * arr1 = @[@"总经理/总裁/首席执行官CEO",@"首席技术官CTO/首席信息官CIO",@"副总经理/副总裁/首席运营官COO",@"首席财务官CFO",@"总监/事业部总经理/运营主管",@"市场总监",@"项目总监",@"总经理助理/总裁助理/董事会秘书",@"办事处/分公司/分支机构经理",@"合伙人"];
    NSArray * arr2 = @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"客户代表",@"网络销售",@"电子商务专员",@"销售助理"];
    NSArray * arr3 = @[@"市场总监",@"市场经理/主管",@"市场助理/专员",@"市场策划/企划",@"市场分析/调研",@"市场推广经理/主管",@"市场推广专员",@"产品/品牌经理",@"产品/品牌专员",@"会务经理/主管",@"促销督导经理/主管"];
    NSArray * arr4 = @[@"项目总监",@"项目经理",@"项目主管",@"项目专员/助理",@"项目工程师"];
    NSArray * arr5 = @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"企业文化/企划管理",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"员工关系/工会管理",@"职业规划师",@"职业指导师",@"职业咨询师",@"其他人力资源类"];
    NSArray * arr6 = @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理",@"电脑操作员/打字员/校对",@"保安",@"合同管理",@"法务主管/专员",@"行政/人事/文职/后勤",@"仓库管理员",@"采购专员/助理"];
    
    NSArray * arr7 = @[@"首席技术官CTO/首席信息官CIO",@"技术总监",@"项目总监",@"信息技术经理/主管",@"项目经理",@"信息技术专员",@"系统集成工程师",@"系统测试",@"网络/系统工程师",@"信息安全工程师",@"数据库管理员",@"数据库开发工程师",@" ERP系统工程师",@"系统/网络管理"];
    
    NSArray * arr8 = @[@"通信网络工程师",@"射频工程师",@"数据通信工程师",@"通信电源工程师",@"硬件开发/网络通讯",@"硬件测试",@"硬件工程师",@"软件测试",@"JAVA软件工程师",@"手机应用开发工程师",@"手机动画设计师",@"手机结构工程师",@"手机驱动/测试工程师",@"手机维修工程师",@"嵌入式硬件/软件工程师",@"通信管线工程师",@"通信工程师",@"有线传输工程师"];
    NSArray * arr9 = @[@"网站运营总监",@"网站运营经理/主管",@"产品经理",@"系统架构设计师",@"互联网软件开发工程师",@"网站策划/管理",@"网站推广/优化/seo",@"网页设计师",@"美工",@"产品专员",@"网站编辑",@"IT工程师",@"测试工程师",@"美术/图形设计",@"动画/3D设计",@"Flash设计制作",@"游戏设计师"];
    
    
    NSArray * arr10 = @[@"高级硬件工程师",@"软件工程师",@"硬件工程师",@"测试工程师",@"数据库开发工程师",@"研发工程师",@"系统架构设计师",@"交互设计师",@"程序员",@"网络工程师",@"系统分析员",@"UI工程师",@"软件维护/开发/实施",@"PHP程序员",@"Android工程师",@"Delphi工程师",@"ios/iPad工程师",@"C语言工程师",@"GIS/GPS开发工程师"];
    NSArray * arr11 = @[@"首席财务官CFO",@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师",@"财务经理",@"审计师/审计员"];
    
    NSArray * arr12 = @[@"工厂厂长/副厂长/工厂经理",@"生产经理/车间主任",@"生产计划/调度",@"生产主管/督导/领班",@"生产跟单/单证",@"设备工程师/设备维护",@"设备经理/主管",@"精益生产"];
    NSArray * arr13 = @[@"总装工程师",@"总布置工程师",@"车身/造型设计",@"发动机/附件设计",@"内外饰设计",@"涂装工程师/技术员",@"汽车经纪/二手车估价师",@"汽车试验/测试/验车员",@"4S店长",@"汽车美容",@"展厅经理/主管",@"服务顾问/接车员",@"投诉/回访/异议处理",@"驾驶培训",@"底盘工程师",@"质量管理员",@"电子工程师/技术员",@"系统工程师",@"销售代表/营销经理",@"司机",@"配件经理/主管",@"资料员",@"保险理赔"];
    NSArray * arr14 = @[@"矿长/副矿长",@"冶金工程师",@"地质工程师",@"冶炼工程师",@"炼钢工程师",@"熔铸工程师",@"采矿工程师/技术员",@"选矿工程师/技术员",@"通风工程师/技术员",@"氧化工程师/技术员",@"电解工程师/技术员",@"矿建/井建工程师",@"矿权评估",@"矿物分析/化验",@"金属材料/压力加工"];
    NSArray * arr15 = @[@"油田化学工程师",@"地震采集/解释工程师",@"地球物理工程师",@"地质工程师",@"物探工程师",@"油藏工程师",@"钻井工程师",@"录井工程师",@"测井/解释工程师",@"完井工程师",@"泥浆工程师",@"压裂工程师",@"油田开发监督",@"调剖堵水工程师",@"采油工程师",@"数值模拟工程师"];
    NSArray * arr16 = @[@"客服经理/主管（非技术)",@"客服专员/助理（非技术）",@"技术支持经理/主管",@"产品技术支持/技术",@"售后服务",@"客服总监",@"咨询热线/呼叫中心服务人员",@"网店客服",@"销售客服",@"技术支持/客服",@"客服/技术支持/文职",@"售前客服"];
    NSArray * arr17 = @[@"品质经理/主管(QA/QC经理/主管)",@"品质工程师(QA/QC工程师)",@"化验/检验/质检/测试员",@"体系/认证工程师/审核员（ISO等）",@"安全/健康/环境"];
    NSArray * arr18 = @[@"暖通工程师",@"暖通设计师",@"制冷工程师",@"空调工程师",@"洁净/净化工程师",@"热泵工程师/技术员",@"暖通设计主管/主任",@"空调设计师",@"水暖工程师",@"工艺工程师/工艺员"];
    NSArray * arr19 = @[@"注册监理工程师",@"专业监理工程师",@"总监理工程师",@"监理员",@"注册设备监理工程师",@"总监理工程师代表",@"安全监理工程师",@"监理工程师",@"造价工程师",@"造价员/预算",@"招标代理工程师",@"招标代理人员",@"土地估价师",@"资产评估师",@"造价技术负责人"];
    NSArray * arr20 = @[@"机械工程师",@"模具工程师",@"机电工程师",@"铸造/锻造工程师",@"注塑/吹塑工程师",@"CNC/数控工程师",@"冲压工程师/技师",@"刀具工程师",@"夹具工程师/技师",@"仪表/计量工程师",@"变压/变频工程师",@"机械绘图师",@"液压工程师/技术员",@"焊接工程师",@"机械设计工程师",@"制造工程师",@"刀具应用工程师"];
    
    NSArray * arr21 = @[@"房地产开发/策划",@"房地产估价师",@"前期开发类",@"前期开发部总监/经理/主管",@"报批报建经理/主管",@"招商经理/主管",@"报建员",@"注册咨询工程师",@"物业经理/主任/主管"];
    NSArray * arr22 = @[@"建造师",@"建筑工程师",@"资料员",@"施工员",@"材料员",@"生产经理",@"建模人员",@"质检员",@"工长",@"安装/水电工程师",@"项目经理",@"项目工程师",@"土建工程师",@"现场/施工管理",@"取样员",@"钢筋翻样",@"桩基工程师",@"加固工程师",@"安装工程师",@"空调工程师",@"管道工程师 ",@"防腐保温",@"制冷工程师",@"市政工程师",@"钢结构设计师",@"钢结构工程师"];
    NSArray * arr23 = @[@"总建筑师/高级建筑师",@"审图工程师",@"规划师",@"建筑师/建筑设计师",@"结构工程师",@"暖通工程师",@"电气工程师",@"设备工程师",@"效果图制作/建筑制图",@"给排水工程师",@"注册建筑师",@"建模人员",@"BIM工程师"];
    NSArray * arr24 = @[@"测绘工程师",@"测量组长 ",@"测量员/技工",@"测绘内业/制图",@"航测遥感",@"GIS/GPS软件工程师",@"数据处理",@"水文地质工程",@"岩土工程师",@"钻井工程师",@"司钻/副司钻",@"采矿工程师/技术员",@"测量工程师"];
    NSArray * arr25 = @[@"园林/景观设计师",@"园林/景观工程师",@"园艺工程师",@"园林绿化/养护",@"植物设计/配置",@"施工图设计师",@"园艺设计师",@"方案设计工程师",@"雕塑设计师",@"设计助理",@"雕塑师",@"花卉工程师",@"苗圃场长",@"苗圃技术员"];
    NSArray * arr26 = @[@"路基/路面工程师",@"隧道工程师",@"沥青/养护人员",@"铁道/地铁/轨道工程师",@"港口/航道/水运工程师",@"公路/桥梁设计师",@"线路/站场设计",@"信号工程师",@"通信工程师",@"桥梁/桥涵工程师",@"路桥工程师"];
    NSArray * arr27 = @[@"试验室主任",@"试验检测工程师",@"试验检测员",@"安全主任",@"安全工程师",@"安全员"];
    NSArray * arr28 = @[@"装饰设计师",@"室内设计师",@"平面设计",@"幕墙设计师",@"家具设计师",@"门窗设计师",@"幕墙工程师",@"软装设计师",@"展览设计师"];
    NSArray * arr29 = @[@"电气工程师/技术员",@"自动化仪表工程师",@"自动控制工程师/技术员",@"断路器工程师/技术员",@"开关电源工程师",@"电控工程师/技术员",@"变压/变频工程师",@"节能工程师/技术员",@"成套设计工程师/技术员",@"防雷工程师/技术员",@"传感器工程师/技术员",@"互感器工程师/技术员",@"继保工程师/技术员",@"工控工程师",@"电子工程师/技术员",@"电抗器工程师",@"高压开关研发/设计"];
    NSArray * arr30 = @[@"电厂厂长/副厂长",@"值长/班长",@"电厂运行",@"电厂安全/安监",@"电厂检修",@"电厂化学/水处理",@"电厂点检",@"核电设计",@"供配电设计",@"发输变电设计/电网设计规划",@"火力发电设计",@"水电设计",@"热机系统工程师",@"核反应系统工程师",@"堆工系统工程师",@"回路系统工程师",@"三废系统工程师",@"热能工程师",@"锅炉工程师/技师",@"锅炉设计",@"锅炉主操/锅炉工"];
    NSArray * arr31 = @[@"水利工程师",@"水利水电设计",@"水力设计",@"水电站运维",@"电站管理工程师",@"水土保持监测",@"水文水资源",@"水保工程师",@"农田水利工程师",@"土地复垦",@"堤坡防护",@"灌溉工程师",@"水工设计师",@"水工工程师",@"土地整理及规划",@"水保方案编制工程师",@"水轮发电机"];
    NSArray * arr32 = @[@"电源工程师",@"LED工程师",@"IE工程师",@"PACK工程师",@"电芯工程师",@"封装工程师",@"照明设计师",@"照明工程师",@"产品设计工程师",@"PE工程师",@"电路设计工程师",@"PCB工程师"];
    NSArray * arr33 = @[@"光伏系统工程师",@"光电工程师/技术员",@"光热工程师/技术员",@"切片工程师/技术员",@"薄膜工程师/技术员",@"组件工程师/技术员",@"逆变器工程师/技术员",@"设备工程师/设备维护",@"变压器工程师",@"断路器工程师/技术员",@"PLC工程师"];
    NSArray * arr34 = @[@"选煤设计",@"选煤/洗煤",@"水煤浆",@"喷煤技术",@"煤质分析/化验",@"煤型加工",@"煤气化",@"煤焦化/炼焦",@"煤化油",@"煤化工工程师",@"煤化工",@"煤层气",@"采煤掘进",@"井下支护",@"瓦检员"];
    NSArray * arr35 = @[@"化学分析工程师",@"塑料工程师",@"化工工程师/技术员",@"精细化工工程师",@"无机化工工程师",@"配方工程师",@"香水研发工程师",@"乳品饮料应用工程师",@"烟用香精调香师",@"日化香精调香师",@"咸味香精调香师",@"甜味香精调香师",@"酶制剂研发工程师",@"光学材料工程师"];
    NSArray * arr36 = @[@"环保工程师/技术员",@"环评工程师/技术员",@"给排水工程师",@"循环冷却水处理",@"固废/垃圾处理",@"废水/污水处理",@"废气治理",@"烟气脱硫工艺",@"水质分析/化验",@"环境在线监测",@"水处理工程师",@"电厂化学/水处理",@"净水/纯水处理",@"脱硫除尘工程师",@"防腐保温",@"脱硝工艺工程师"];
    NSArray * arr37 = @[@"服装/纺织设计",@"皮革设计师",@"面料辅料开发",@"织造/染色/定型/印花",@"服装打样/制版",@"纸样师/车板工",@"裁剪车缝熨烫",@"家纺设计师",@"质量管理员"];
    NSArray * arr38 = @[@"首饰设计",@"珠宝设计",@"珠宝鉴定",@"首饰倒模",@"首饰电金",@"首饰雕腊",@"首饰起板",@"首饰镶嵌",@"首饰执模",@"首饰执边",@"首饰学徒",@"珍珠加工",@"珍珠养殖",@"配石/分石员"];
    NSArray * arr39 = @[@"陶瓷设计师",@"陶瓷手工成型",@"陶瓷选料",@"陶瓷喷釉",@"陶瓷装罐工",@"陶瓷刮平工",@"窑炉工程师/技术员",@"陶瓷彩绘",@"卫浴设计",@"釉料技术",@"陶瓷印花/贴花",@"陶瓷色料调色开发",@"洁具设计师",@"注塑/吹塑工程师",@"造型设计",@"石材设计师",@"工业设计师",@"橱柜设计师"];
    NSArray * arr40 = @[@"包装设计",@"材料工程师",@"印刷工程师/技师",@"印刷机长/助手",@"烫金/模切",@"晒版/装订",@"造纸/制浆技术员",@"包装工程师",@"分切工/切纸工",@"复合/涂布/扫描",@"文字录入/排版",@"制袋/切袋",@"调墨技师",@"数码直印/菲林输出",@"防伪设计",@"印刷排版/制版专员",@"平面设计师",@"造纸化学品"];
    NSArray * arr41 = @[@"生物工程/生物制药",@"化学分析测试员",@"临床研究员",@"临床协调员",@"药品注册",@"药品生产/质量管理",@"医疗器械注册",@"医疗卫生人员",@"临床监察员",@"临床推广",@"医药研发管理人员",@"医药合成工程师/技术员",@"医药研发人员",@"医药学检验"];
    NSArray * arr42 = @[@"医院管理人员",@"专科医生",@"牙科医生",@"麻醉医生",@"美容整形师",@"心理医生",@"营养师",@"药库主任/药剂师",@"医药学检验",@"公共卫生/疾病控制",@"护理主任/护士长",@"护士/护理人员",@"验光师",@"物理治疗师/士",@"康复医师",@"理疗师",@"医导/前台",@"执业药师/驻店药师"];
    NSArray * arr43 = @[@"美容顾问/化妆",@"美容助理/见席美容师",@"发型师",@"发型助理/学徒",@"美甲师",@"按摩/足疗",@"健身顾问/教练",@"瑜伽/舞蹈老师",@"瘦身顾问",@"营养师"];
    NSArray * arr44 = @[@"场长",@"苗木主管/技术员",@"种植技术",@"养殖工程师/技术员",@"饲养员",@"植保专员",@"育种员",@"水产养殖",@"畜牧师",@"农化服务",@"配方工程师",@"农艺师",@"林业员",@"稽核员",@"兽医",@"动保研发",@"制剂师",@"食品工程师",@"水产技术服务"];
    NSArray * arr45 = @[@"证券分析师",@"证券/期货/外汇经纪人",@"股票/期货操盘手",@"投融资经理/主管",@"投资/理财顾问",@"拍卖师",@"期货分析师",@"风控经理/主管",@"风控专员",@"期货操盘手",@"黄金/外汇经纪人",@"黄金/外汇操盘手",@"黄金/外汇分析师",@"证券事务代表",@"交易员/开户员",@"典当师"];
    NSArray * arr46 = @[@"行长/副行长",@"资产评估/分析",@"银行柜员",@"保险代理/经纪人/客户经理",@"保险核保",@"保险理赔",@"信贷管理"];
    NSArray * arr47 = @[@"广告创意总监",@"广告创意/设计主管/专员",@"广告设计师/广告制作",@"美术指导",@"美术设计",@"平面设计",@"动漫制作",@"游戏设计师",@"动画/3D设计",@"形象设计顾问",@"文案/策划",@"美工",@"网页设计师",@"UI工程师",@"前端开发工程师",@"文案策划/编辑",@"店面/陈列/展览设计",@"原画设计师",@"印刷排版/制版专员"];
    NSArray * arr48 = @[@"影视策划/制作人员",@"导演/编导",@"艺术/设计总监",@"经纪人/星探",@"演员/模特/主持人",@"摄影师",@"音效师",@"配音员",@"化妆师/造型师",@"编辑",@"作家/撰稿人",@"总编/副总编",@"记者",@"美术编辑",@"音效/配音/灯光",@"灯光师",@"配音师/录音师",@"服装/试衣模特",@"服装陈列师"];
    NSArray * arr49 = @[@"餐饮/娱乐管理",@"酒店/宾馆营销",@"酒店/宾馆经理",@"大堂经理",@"客房服务员/楼面服务员",@"领班",@"服务员",@"订票/订房服务",@"导游/旅行顾问",@"礼仪/迎宾",@"行政主厨/厨师长",@"厨师/面点师",@"调酒师",@"茶艺师",@"房务总监",@"楼层领班",@"营养师",@"演员/模特/主持人",@"签证专员",@"食雕"];
    NSArray * arr50 = @[@"店长/卖场经理/楼面经理",@"店员/营业员",@"防损员/内保",@"收银主管",@"收银员",@"理货员",@"收货员",@"陈列员",@"导购员",@"兼职店员"];
    NSArray * arr51 = @[@"保安经理",@"保安",@"清洁工",@"搬家",@"司机",@"保姆/月嫂",@"电器维修"];
    NSArray * arr52 = @[@"大学教授",@"讲师/助教",@"中学教",@"中小学教师",@"幼教",@"院校教务管理人员",@"兼职教师",@"家教",@"培训师",@"职业教育",@"校长/院长",@"数控教师/培训",@"专业教师",@"书法教师",@"国学教师",@"韩语教师",@"法语教师",@"初中教师",@"高中教师",@"英语教师",@"日语教师",@"美术教师"];
    NSArray * arr53 = @[@"法务主管/专员",@"知识产权/专利顾问/专员",@"公证员",@"法律顾问",@"律师",@"律师/法务助理"];
    NSArray * arr54 = @[@"咨询经理",@"咨询员",@"调研员",@"培训师"];
    NSArray * arr55 = @[@"采购经理/主管",@"采购专员/助理",@"供应商管理",@"材料/设备采购管理",@"采购总监",@"采购工程师"];
    NSArray * arr56 = @[@"外贸/贸易经理/主管",@"外贸/贸易专员/助理",@"单证员",@"报关/报检/核销",@"采购专员/助理",@"采购经理/主管"];
    NSArray * arr57 = @[@"物流经理/主管",@"物流专员/助理",@"运输经理/主管",@"货运代理",@"快递员/配送员",@"理货员",@"司机",@"物流总监",@"仓库管理员",@"仓库/物料管理"];
    NSArray * arr58 = @[@"钳工",@"线切割工",@"车/铣/刨/磨/镗工",@"钻/冲工",@"钣金工",@"电火花工",@"雕刻工",@"电工",@"铲刮工",@"折弯工",@"锣工",@"油漆工",@"行车工",@"操作工",@"拉钢工",@"浇钢工",@"抛光工",@"装配工",@"模具维修",@"打磨工",@"机床修理工",@"焊工/铆工",@"维修工",@"模具工",@"其它技工",@"喷塑工",@"嵌线工",@"多工位技师"];
    NSArray * arr59 = @[@"公关媒介经理/主管",@"公关媒介专员",@"公关媒介策划",@"公关媒介执行",@"媒介销售",@"媒介研究",@"媒介经理/专员",@"媒介总监",@"公关/媒介助理",@"文案策划/编辑"];
    NSArray * arr60 = @[@"英语翻译",@"日语翻译",@"韩语翻译",@"法语翻译",@"德语翻译",@"其他语种翻译"];
    NSArray * arr61 = @[@"储备干部"];
    
    objectArr_ = [NSArray arrayWithObjects:arr1,arr2,arr3,arr4,arr5,arr6,arr7,arr8,arr9,arr10,arr11,arr12,arr13,arr14,arr15,arr16,arr17,arr18,arr19,arr20,arr21,arr22,arr23,arr24,arr25,arr26,arr27,arr28,arr29,arr30,arr31,arr32,arr33,arr34,arr35,arr36,arr37,arr38,arr39,arr40,arr41,arr42,arr43,arr44,arr45,arr46,arr47,arr48,arr49,arr50,arr51,arr52,arr53,arr54,arr55,arr56,arr57,arr58,arr59,arr60,arr61,nil];
}



//二级数组
-(void)createArr1
{
    NSArray * arr1 = @[@"经营管理类",@"总工程师/副总工程"
                      ,@"销售类",@"火力发电/电厂",@"电力设计类",@"项目管理类",@"电力施工/工程类",@"监理类",@"电气设备/自动化类"
                      ,@"电力环保类",@"水力发电类",@"核电类",@"风力发电类",@"光伏发电类",@"成本类",@"安全类"
                      ,@"技术支持/客服类",@"系统/网络管理",@"软件技术/研发类",@"品质/质检类",@"咨询/顾问类",@"人力资源类"
                      ,@"市场/策划/推广类",@"行政管理类",@"财务/审计/统计类",@"贸易/进出口类",@"采购类",@"物流/仓储类"
                      ,@"翻译类",@"律师/法务/合规类",@"车间技工类"];
    NSArray * arr2 = @[@"经营管理类",@"项目管理类",@"工艺类"
                      ,@"涂料/油漆/油墨类",@"塑料/橡胶类",@"日化类",@"化肥/农药/农资类",@"销售类",@"化纤类",@"制药类"
                      ,@"颜料/染料类",@"玻璃/陶瓷类",@"火工类",@"环保/脱硫/水处理类",@"矿产/地质/钢铁/冶金类"
                      ,@"机械/机电设备/仪器仪表类",@"生产管理类",@"品质/质检类",@"技术支持/客服类",@"市场/策划/推广类"
                      ,@"车间技工类",@"人力资源类",@"行政管理类",@"财务/审计/统计类",@"采购类",@"物流/仓储类",@"贸易/进出口类"
                      ,@"翻译类",@"其他"];
    NSArray * arr3 = @[@"总工程师/副总工程",@"机电工程师"
                      ,@"机械工程师",@"研发部经理/技术主管",@"电气工程师/技术员",@"工艺工程师/工艺员",@"制造工程师"
                      ,@"机械设计工程师",@"研发工程师",@"自动控制工程师/技术员",@"焊接工程师",@"电机工程师",@"冲压工程师/技师"
                      ,@"仪表/计量工程师",@"夹具工程师/技师",@"项目工程师",@"结构工程师",@"钣金工艺师",@"机械绘图师"
                      ,@"经营管理类",@"销售类",@"市场/策划/推广类",@"汽车/汽配/驾培类",@"泵阀/流体/液压",@"船舶/海运类"
                      ,@"机床/数控/刀具类",@"模具/铸造/锻造",@"暖通/空调/制冷",@"生产管理类",@"车间技工类",@"品质/质检类"
                      ,@"技术支持/客服类",@"人力资源类",@"行政管理类",@"财务/审计/统计类",@"贸易/进出口类",@"物流/仓储类"
                      ,@"采购类",@"计算机（IT）类",@"翻译",@"其他"];
    NSArray * arr4 = @[@"施工类",@"建筑设计类",@"设计类"
                      ,@"成本类",@"市政公用",@"路桥/隧道/桥梁类",@"园林/景观类",@"岩土/水文/矿井",@"监理类",@"安装工程"
                      ,@"钢结构/网架类",@"测量类",@"装饰/幕墙类",@"爆破/拆除",@"试验/检测/质检类",@"生产管理类",@"项目管理类"
                      ,@"总工程师/副总工程",@"经营管理类",@"销售/客服类",@"人力资源类",@"行政管理类",@"财务/审计/统计类"
                      ,@"翻译类",@"计算机类",@"安全类",@"消防类",@"通信工程",@"物业管理类",@"石油相关类"];
    NSArray * arr5 = @[@"经营管理类",@"销售类"
                      ,@"市场/策划/推广类",@"总工程师/副总工程",@"研发部经理/技术主管",@"工艺工程师/工艺员",@"机械工程师"
                      ,@"模具工程师",@"陶瓷/卫浴洁具/耐火类",@"水泥/混凝土类",@"木业类",@"管业类",@"项目管理类",@"生产管理类"
                      ,@"品质/质检类",@"技术支持/客服类",@"人力资源类",@"行政管理类",@"采购类",@"贸易/进出口类"
                      ,@"财务/审计/统计类",@"物流/仓储/运输类",@"车间技工类"];
    NSArray * arr6 = @[@"经营管理类",@"销售类"
                      ,@"贸易/进出口类",@"项目管理类",@"印刷机长/助手",@"印刷排版/制版专员",@"印刷工程师/技师",@"调墨技师"
                      ,@"包装工程师",@"包装设计",@"注塑/吹塑工程师",@"制袋/切袋",@"防伪设计",@"复合/涂布/扫描",@"烫金/模切"
                      ,@"文字录入/排版",@"晒版/装订",@"平面设计师",@"生产管理类",@"品质/质检类",@"人力资源类",@"行政管理类"
                      ,@"财务/审计/统计类",@"物流/仓储类",@"车间技工类",@"其他"];
    NSArray * arr7 = @[@"经营管理类",@"销售类"
                       ,@"技术支持/客服类",@"项目管理类",@"矿长/副矿长",@"总工程师/副总工程",@"研发工程师",@"钢铁/冶金类"
                       ,@"矿产/地质类",@"煤炭/煤化工/煤焦化类",@"铜/铝/有色金属类",@"建筑/施工/预算类",@"电气工程师/技术员"
                       ,@"安全/环保类",@"机械/机电设备/仪器仪表类",@"生产管理类",@"品质/质检类",@"车间技工类",@"人力资源类"
                       ,@"行政管理类",@"财务/审计/统计类",@"采购类",@"贸易/进出口类",@"物流/仓储类",@"翻译类"
                       ,@"应届毕业生/实习生",@"其他"];
    NSArray * arr8 = @[@"环保工程师/技术员",@"水处理工程师"
                      ,@"工艺工程师/工艺员",@"工程部经理",@"经营管理类",@"项目管理类",@"脱硫/脱硝/除尘类",@"环保技术类"
                      ,@"销售类",@"给排水工程师",@"技术/管理类",@"运营/施工类",@"电力环保类",@"生产管理类",@"品质/质检类"
                      ,@"机电/机械/仪器仪表类",@"建筑/土建/预算类",@"市场/策划/推广类",@"其他技术类",@"人力资源类",@"行政管理类"
                      ,@"财务/审计/统计类",@"物流/仓储类",@"计算机/IT类",@"翻译类",@"车间技工类",@"应届毕业生/实习生"
                      ,@"技术支持/客服类",@"其他"];
    NSArray * arr9 = @[@"司机",@"播音员/主持人"
                      ,@"工程技术人员",@"网络交易员 ",@"美导",@"商务主管/商务人员",@"收银主管",@"售货员",@"工程部"
                      ,@"经营/企划/管理类",@"店长/卖场经理/楼面经理",@"编辑",@"美容师",@"翻译",@"理货员"
                      ,@"质量管理/验货员(QA/QC)",@"促销员/导购",@"记者",@"收银员",@"报关/报检/核销",@"文职",@"行政总监"
                      ,@"经理",@"外贸助理",@"其他"];
    NSArray * arr10 = @[@"经营管理类",@"证券分析师"
                       ,@"证券/金融/投资类",@"银行/保险类",@"财务/审计/统计类",@"咨询/顾问类",@"人力资源类",@"行政管理类"
                       ,@"翻译类",@"应届毕业生/实习生",@"其他"];
    NSArray * arr11 = @[@"卫生医疗类",@"医院管理类"
                       ,@"医疗技术类",@"经营管理类",@"研发/注册类",@"销售类",@"生产管理类",@"生物工程类",@"药店管理类"
                       ,@"化工技术类",@"质量保证/品质管理类",@"设备类",@"美容整形师",@"心理医生",@"兽医",@"其他"];
    
    NSArray * arr12 = @[@"经营管理类",@"高级硬件工程师"
                       ,@"硬件工程师",@"软件工程师",@"品质经理/主管(QA/QC经理/主管)",@"ERP技术/开发应用",@"系统集成工程师"
                       ,@"系统分析员",@"销售类",@"系统工程师",@"教员/老师",@"技术专员",@"部门经理/主管",@"秘书/高级文员"
                       ,@"首席技术官CTO/首席信息官CIO",@"技术支持经理/主管",@"项目专员/助理",@"总监/事业部总经理/运营主管"
                       ,@"研发部经理/技术主管",@"产品技术支持/技术",@"数据库开发工程师",@"网页设计师",@"信息技术专员",@"计量工程师"
                       ,@"标准化工程师",@"计算机辅助设计工程师",@"系统测试",@"软件测试",@"硬件测试",@"测试员",@"系统架构设计师"
                       ,@"程序员",@"项目总监",@"设计人员",@"IT工程师",@"项目主管",@"项目经理",@"其他",@"php工程师"
                       ,@"php网站开发工程师",@"php软件开发工程师",@"php高级程序员",@"php高级开发工程师",@"php高级工程师"
                       ,@"Php软件工程师",@"人力资源类",@"行政/后勤/文职类",@"财务/审计/统计类"];
    NSArray * arr13 = @[@"经营管理类",@"销售类"
                       ,@"技术/研发类",@"品质/质检类",@"生产管理类",@"市场/策划/推广类",@"技术支持/客服类",@"贸易/进出口类"
                       ,@"采购类",@"物流/仓储类",@"人力资源类",@"行政管理类",@"财务/审计/统计类",@"车间技工类",@"其他"];
    
    NSArray * arr14 = @[@"销售/客户类",@"设计/创意类"
                       ,@"文案/策划类",@"公关/媒介类",@"编辑/记者类",@"影视制作类",@"发行类",@"经纪人/演员/主持人/模特/歌手"
                       ,@"人事/行政/后期/IT技术类",@"其他"];
    
    NSArray * arr15 = @[@"经营管理类",@"销售类",@"生产管理类"
                       ,@"机械工程师",@"平面设计师",@"电气工程师",@"软件工程师",@"服装/纺织/皮革类",@"品质/质检类"
                       ,@"店员/营业员",@"市场/策划/推广类",@"车间技工类",@"技术支持/客服类",@"人力资源类",@"行政管理类"
                       ,@"财务/审计/统计类",@"贸易/进出口类",@"采购类",@"物流/仓储类",@"翻译类",@"其他"];
    NSArray * arr16 = @[@"生产管理类",@"销售类"
                       ,@"品质/质检类",@"技术/研发类",@"市场/策划/推广类",@"食品研发应用",@"渠道管理",@"行政管理类"
                       ,@"机械/机电设备/仪器仪表类",@"财务/审计/统计类",@"物流/仓储类",@"技工/普工/工人类",@"咨客",@"储备干部"
                       ,@"翻译",@"其他"];
    NSArray * arr17 = @[@"物流总监",@"物流经理/主管"
                       ,@"物流专员/助理",@"运输经理/主管",@"货运代理",@"快递员/速递员",@"仓库/物料管理",@"船务/空运/陆运操作"
                       ,@"司机",@"理货员",@"调度员",@"供应链管理",@"集装箱业务",@"海关事务管理",@"贸易/进出口类",@"采购类"
                       ,@"经营管理类",@"销售类",@"人力资源类",@"行政管理类",@"市场/策划/推广类",@"技术支持/客服类",@"其他"
                       ,@"财务/审计/统计类"];
    
    NSArray * arr18 = @[@"计调",@"导游/旅行顾问"
                       ,@"旅游操作师",@"外联销售",@"前厅部",@"客房部员工",@"酒店/餐饮/旅游/娱乐类",@"预定/票务人员"
                       ,@"销售经理/销售主管",@"行政/人事/文职/后勤",@"签证专员",@"文员/前台/接待",@"业务员/推销员"
                       ,@"市场助理/专员 ",@"市场经理/主管",@"翻译",@"司机",@"其他"];
    object1Arr_ = [NSArray arrayWithObjects:arr1,arr2,arr3,arr4,arr5,arr6,arr7,arr8,arr9,arr10,arr11,arr12,arr13,arr14,arr15,arr16,arr17,arr18,nil];
}



//三级数组
-(void)createObjectArr2
{
    object2Arr_ = [NSArray arrayWithObjects:[self createArrThree1],[self createArrThree2],[self createArrThree3],[self createArrThree4],[self createArrThree5],[self createArrThree6],[self createArrThree7],[self createArrThree8],[self createArrThree9],[self createArrThree10],[self createArrThree11],[self createArrThree12],[self createArrThree13],[self createArrThree14],[self createArrThree15],[self createArrThree16],[self createArrThree17],[self createArrThree18],nil];
}

-(NSArray*)createArrThree1
{
    NSArray * arr1 = @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人"];
    NSArray * arr2 = @[@"总工程师/副总工程"];
    NSArray * arr3 = @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"促销员/导购",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"销售助理"];
    NSArray * arr4 = @[@"值长/班长",@"电厂运行",@"电厂检修",@"电厂点检",@"电厂化学/水处理",@"司炉工",@"燃料供应",@"固废/垃圾处理",@"电仪检修",@"燃机专业工程师",@"机务工程师",@"电厂厂长/副厂长"];
    NSArray * arr5 = @[@"火力发电设计",@"发输变电设计/电网设计规划",@"供配电设计",@"核电设计",@"水电设计",@"新能源发电设计",@"结构设计师",@"电气设计师",@"土建设计"];
    NSArray * arr6 = @[@"项目总监",@"项目经理",@"项目主管",@"项目专员/助理",@"项目工程师"];
    NSArray * arr7 = @[@"土建工程师",@"建筑工程师",@"测绘工程师",@"建造师",@"结构工程师",@"测量员/技工",@"施工员",@"材料工程师",@"电力计划/调度",@"安装工程师",@"调试工程师"];
    NSArray * arr8 = @[@"注册监理工程师",@"总监理工程师",@"监理员",@"监理工程师"];
    NSArray * arr9 = @[@"生产管理类",@"电气工程师/技术员",@"电子工程师/技术员",@"成套设计工程师/技术员",@"自动化仪表工程师",@"自动控制工程师/技术员",@"断路器工程师/技术员",@"开关电源工程师",@"电控工程师/技术员",@"变压/变频工程师",@"节能工程师/技术员",@"防雷工程师/技术员",@"传感器工程师/技术员",@"互感器工程师/技术员",@"继保工程师/技术员",@"工控工程师",@"机械工程师",@"报价工程师/报价员",@"电厂锅炉专工"];
    NSArray * arr10 = @[@"安评工程师/技术员",@"烟气脱硫工艺",@"脱硫运行",@"非标设计",@"除尘设计",@"热控工程师",@"防腐保温",@"环评工程师/技术员",@"工艺工程师/工艺员",@"化工工程师/技术员",@"脱硫除尘工程师",@"工艺设计"];
    NSArray * arr11 = @[@"水电站运维",@"电站管理工程师"];
    NSArray * arr12 = @[@"回路系统工程师",@"堆工系统工程师",@"性能工程师",@"物理实验工程师",@"化学分析工程师",@"核反应系统工程师",@"热机系统工程师",@"三废系统工程师",@"设备工程师/设备维护"];
    NSArray * arr13 = @[@"风电场运维",@"风电厂检修/巡检"];
    NSArray * arr14 = @[@"光伏系统工程师",@"光电工程师/技术员",@"光热工程师/技术员",@"组件工程师/技术员",@"切片工程师/技术员"];
    NSArray * arr15 = @[@"造价工程师",@"造价员/预算",@"招标代理工程师",@"招标代理人员",@"注册咨询工程师",@"土地估价师",@"资产评估师",@"合同管理"];
    NSArray * arr16 = @[@"安全主任",@"安全工程师",@"安全员",@"电厂安全/安监"];
    NSArray * arr17 = @[@"客服经理/主管（非技术）",@"客服专员/助理（非技术）",@"技术支持经理/主管",@"产品技术支持/技术",@"售后服务"];
    NSArray * arr18 = @[@"系统/网络管理"];
    NSArray * arr19 = @[@"研发部经理/技术主管",@"研发工程师",@"软件工程师",@"硬件工程师",@"测试工程师",@"系统工程师"];
    NSArray * arr20 = @[@"品质经理/主管(QA/QC经理/主管)",@"品质工程师(QA/QC工程师)",@"化验/检验/质检/测试员",@"体系/认证工程师/审核员（ISO等）",@"安全/健康/环境"];
    NSArray * arr21 = @[@"咨询经理",@"咨询员",@"调研员",@"培训师"];
    NSArray * arr22 = @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"企业文化/企划管理",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"员工关系/工会管理",@"其他人力资源类"];
    NSArray * arr23 = @[@"市场总监",@"市场经理/主管",@"市场助理/专员 ",@"市场策划/企划",@"市场分析/调研",@"市场推广经理/主管",@"市场推广专员",@"产品/品牌经理",@"产品/品牌专员",@"会务经理/主管",@"促销督导经理/主管"];
    NSArray * arr24 = @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理",@"电脑操作员/打字员/校对",@"保安",@"合同管理"];
    NSArray * arr25 = @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师"];
    NSArray * arr26 = @[@"外贸/贸易经理/主管",@"外贸/贸易专员/助理",@"单证员",@"报关/报检/核销"];
    NSArray * arr27 = @[@"采购经理/主管",@"采购专员/助理",@"供应商管理",@"材料/设备采购管理",@"采购总监",@"采购工程师"];
    NSArray * arr28 = @[@"物流经理/主管",@"物流专员/助理",@"运输经理/主管",@"货运代理",@"快递员/配送员",@"理货员",@"司机",@"物流总监",@"仓库管理员"];
    NSArray * arr29 = @[@"英语翻译",@"日语翻译",@"韩语翻译",@"法语翻译",@"德语翻译",@"其他语种翻译"];
    NSArray * arr30 = @[@"律师",@"法律顾问",@"律师/法务助理",@"法务主管/专员",@"知识产权/专利顾问/专员",@"公证员"];
    NSArray * arr31 = @[@"钳工",@"机修工",@"线切割工",@"车/铣/刨/磨/镗工",@"钻/冲工",@"钣金工",@"电工",@"操作工",@"装配工",@"焊工/铆工",@"维修工",@"模具工",@"抛光工",@"油漆工",@"机床修理工",@"折弯工",@"其它技工"];
    
    NSArray * objectArr = [NSArray arrayWithObjects:arr1,arr2,arr3,arr4,arr5,arr6,arr7,arr8,arr9,arr10,arr11,arr12,arr13,arr14,arr15,arr16,arr17,arr18,arr19,arr20,arr21,arr22,arr23,arr24,arr25,arr26,arr27,arr28,arr29,arr30,arr31,nil];
    
    return objectArr;
   
}


-(NSArray *)createArrThree2
{
    NSArray * arr1 = @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人"];
    NSArray * arr2 = @[@"项目总监",@"项目经理",@"项目主管",@"项目专员/助理",@"项目工程师",@"现场/施工管理"];
    NSArray * arr3 = @[@"研发工程师",@"无机化工工程师",@"精细化工工程师",@"化工工程师/技术员",@"化学分析工程师",@"配方工程师",@"工艺工程师/工艺员",@"配色工程师"];
    NSArray * arr4 = @[@"调色工程师/调色员",@"涂料工程师"];
    NSArray * arr5 = @[@"改性工程师",@"塑料工程师",@"挤出/成型技术员",@"分拣/造粒/破碎",@"模具工程师"];
    NSArray * arr6 = @[@"食用香精应用工程师",@"香精评估员",@"光学工程师 ",@"化妆品研发工程师",@"洗涤用品研发工程师",@"表面活性剂工程师",@"口腔用品研发",@"香精香料工程师",@"除臭剂研发",@"皂类工程师",@"制膏工",@"乳化工",@"称料工",@"调和员",@"包装设计"];
    NSArray * arr7 = @[@"制剂师",@"农药登记",@"原药助剂",@"农化服务",@"农艺师",@"发酵技术员",@"植保专员"];
    NSArray * arr8 = @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"促销员/导购",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"销售助理"];
    NSArray * arr9 = @[@"化纤工程师",@"织带工",@"卷绕工"];
    NSArray * arr10 = @[@"医药研发人员",@"医药研发管理人员",@"医药合成工程师/技术员",@"OTC销售代表",@"生物工程/生物制药"];
    NSArray * arr11 = @[@"染色工程师",@"调色工程师/调色员",@"彩绘师",@"染整工程师"];
    NSArray * arr12 = @[@"窑炉工程师/技术员",@"锡退工程师",@"陶瓷装罐工",@"陶瓷设计师",@"陶瓷喷釉",@"陶瓷刮平工",@"陶瓷彩绘"];
    NSArray * arr13 = @[@"炸药研发人员",@"雷管研发人员",@"爆破工程师",@"高分子工程师",@"安全工程师"];
    NSArray * arr14 = @[@"环保工程师/技术员",@"防腐保温",@"给排水工程师",@"水处理"];
    NSArray * arr15 = @[@"矿长/副矿长",@"冶金工程师",@"地质工程师",@"冶炼工程师",@"炼钢工程师",@"熔铸工程师",@"采矿工程师/技术员",@"选矿工程师/技术员",@"通风工程师/技术员",@"氧化工程师/技术员",@"电解工程师/技术员",@"矿建/井建工程师",@"矿权评估",@"矿物分析/化验",@"金属材料/压力加工",@"测绘工程师"];
    NSArray * arr16= @[@"机械工程师",@"模具工程师",@"机电工程师",@"铸造/锻造工程师",@"注塑/吹塑工程师",@"CNC/数控工程师",@"冲压工程师/技师",@"刀具工程师",@"夹具工程师/技师",@"仪表/计量工程师",@"机械绘图师",@"自动控制工程师/技术员",@"电气工程师/技术员",@"压力容器工程师",@"制冷工程师",@"空分工程师",@"管道工程师 ",@"暖通工程师",@"热能工程师",@"动力/能源工程",@"焊接工程师",@"机械设计工程师",@"制造工程师"];
    NSArray * arr17 = @[@"工厂厂长/副厂长/工厂经理",@"生产经理/车间主任",@"生产计划/调度",@"生产主管/督导/领班",@"生产跟单/单证",@"设备工程师/设备维护",@"设备经理/主管",@"精益生产"];
    NSArray * arr18 = @[@"品质经理/主管(QA/QC经理/主管)",@"品质工程师(QA/QC工程师)",@"化验/检验/质检/测试员",@"体系/认证工程师/审核员（ISO等）",@"安全/健康/环境"];
    NSArray * arr19= @[@"客服经理/主管（非技术）",@"客服专员/助理（非技术）",@"技术支持经理/主管",@"产品技术支持/技术",@"售后服务",@"客服总监",@"咨询热线/呼叫中心服务人员"];
    NSArray * arr20= @[@"市场总监",@"市场经理/主管",@"市场助理/专员 ",@"市场策划/企划",@"市场分析/调研",@"市场推广经理/主管",@"市场推广专员",@"产品/品牌经理",@"产品/品牌专员",@"会务经理/主管",@"促销督导经理/主管"];
    NSArray * arr21 = @[@"钳工",@"机修工",@"线切割工",@"车/铣/刨/磨/镗工",@"钻/冲工",@"钣金工",@"电火花工",@"雕刻工",@"电工",@"操作工",@"装配工",@"抛光工",@"焊工/铆工",@"维修工",@"打磨工",@"锣工",@"油漆工",@"机床修理工",@"模具工",@"铲刮工",@"折弯工",@"行车工",@"拉钢工",@"浇钢工",@"模具维修",@"喷漆工",@"其它技工"];
    NSArray * arr22 = @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"企业文化/企划管理",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"员工关系/工会管理",@"其他人力资源类"];
    NSArray * arr23 = @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理 ",@"电脑操作员/打字员/校对",@"保安",@"合同管理"];
    NSArray * arr24 = @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师"];
    NSArray * arr25 = @[@"采购经理/主管",@"采购专员/助理",@"供应商管理",@"材料/设备采购管理",@"采购总监",@"采购工程师"];
    NSArray * arr26 = @[@"物流经理/主管",@"物流专员/助理",@"运输经理/主管",@"货运代理",@"快递员/配送员",@"理货员",@"司机",@"物流总监",@"仓库管理员"];
    NSArray * arr27 = @[@"外贸/贸易经理/主管",@"外贸/贸易专员/助理",@"单证员",@"报关/报检/核销"];
    NSArray * arr28 = @[@"韩语翻译",@"法语翻译",@"德语翻译",@"其他语种翻译",@"英语翻译",@"日语翻译"];
    NSArray * arr29 = @[@"其他"];
    
    NSArray * objectArr = [NSArray arrayWithObjects:arr1,arr2,arr3,arr4,arr5,arr6,arr7,arr8,arr9,arr10,arr11,arr12,arr13,arr14,arr15,arr16,arr17,arr18,arr19,arr20,arr21,arr22,arr23,arr24,arr25,arr26,arr27,arr28,arr29,nil];
    
    return objectArr;
    
}

-(NSArray *)createArrThree3
{
    
    NSArray * arr1 = @[@"总工程师/副总工程"];
    NSArray * arr2 = @[@"机电工程师"];
    NSArray * arr3 = @[@"机械工程师"];
    NSArray * arr4 = @[@"研发部经理/技术主管"];
    NSArray * arr5 = @[@"电气工程师/技术员"];
    NSArray * arr6 = @[@"工艺工程师/工艺员"];
    NSArray * arr7 = @[@"制造工程师"];
    NSArray * arr8 = @[@"机械设计工程师"];
    NSArray * arr9 = @[@"研发工程师"];
    NSArray * arr10 = @[@"自动控制工程师/技术员"];
    NSArray * arr11 = @[@"焊接工程师"];
    NSArray * arr12 = @[@"电机工程师"];
    NSArray * arr13 = @[@"冲压工程师/技师"];
    NSArray * arr14 = @[@"仪表/计量工程师"];
    NSArray * arr15 = @[@"夹具工程师/技师"];
    NSArray * arr16= @[@"项目工程师"];
    NSArray * arr17 = @[@"结构工程师"];
    NSArray * arr18 = @[@"钣金工艺师"];
    NSArray * arr19= @[@"机械绘图师"];
    NSArray * arr20= @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人"];
    NSArray * arr21 = @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"销售助理"];
    NSArray * arr22 = @[@"市场总监",@"市场经理/主管",@"市场助理/专员 ",@"市场策划/企划",@"市场分析/调研",@"市场推广经理/主管",@"市场推广专员",@"产品/品牌经理",@"产品/品牌专员",@"会务经理/主管",@"促销督导经理/主管"];
    NSArray * arr23 = @[@"总装工程师",@"总布置工程师",@"车身/造型设计",@"发动机/附件设计",@"内外饰设计",@"涂装工程师/技术员",@"汽车经纪/二手车估价师",@"汽车试验/测试/验车员",@"4S店长",@"汽车美容",@"展厅经理/主管",@"服务顾问/接车员",@"投诉/回访/异议处理",@"底盘工程师"];
    NSArray * arr24 = @[@"阀门工程师",@"泵工程师",@"液压系统设计",@"液压元件设计",@"液压工程师/技术员"];
    NSArray * arr25 = @[@"船体",@"船舶设计",@"轮机",@"管系",@"涂装",@"放样",@"舾(内)装",@"船舶电气",@"船坞码头基建",@"无损检测",@"精度控制",@"工法",@"审图工程师"];
    NSArray * arr26 = @[@"CNC/数控工程师",@"CNC/数控编程员",@"刀具工程师",@"机床维修/改造工程师",@"数控教师/培训",@"CNC操作工"];
    NSArray * arr27 = @[@"热流道工程师",@"CAE/模流分析",@"模具师傅/补师",@"模具学徒",@"模具工程师",@"铸造/锻造工程师",@"注塑/吹塑工程师",@"热处理工程师/技术员",@"报价工程师/报价员"];
    NSArray * arr28 = @[@"暖通工程师",@"暖通设计师",@"通风工程师/技术员",@"洁净/净化工程师",@"热泵工程师/技术员",@"制冷工程师",@"给排水工程师"];
    NSArray * arr29 = @[@"工厂厂长/副厂长/工厂经理",@"生产经理/车间主任",@"生产计划/调度",@"生产主管/督导/领班",@"生产跟单/单证",@"设备工程师/设备维护",@"设备经理/主管",@"精益生产"];
    NSArray * arr30 = @[@"钳工",@"线切割工",@"车/铣/刨/磨/镗工",@"钻/冲工",@"钣金工",@"电火花工",@"雕刻工",@"电工",@"铲刮工",@"折弯工",@"锣工",@"油漆工",@"行车工",@"操作工",@"模具工",@"拉钢工",@"浇钢工",@"抛光工",@"装配工",@"模具维修",@"打磨工",@"机床修理工",@"焊工/铆工",@"维修工",@"其它技工"];
    NSArray * arr31 = @[@"品质经理/主管(QA/QC经理/主管)",@"品质工程师(QA/QC工程师)",@"化验/检验/质检/测试员",@"体系/认证工程师/审核员（ISO等）",@"安全/健康/环境"];
    NSArray * arr32 = @[@"客服经理/主管（非技术）",@"客服专员/助理（非技术）",@"技术支持经理/主管",@"产品技术支持/技术",@"售后服务",@"客服总监",@"咨询热线/呼叫中心服务人员"];
    NSArray * arr33 = @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"企业文化/企划管理",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"员工关系/工会管理",@"其他人力资源类"];
    NSArray * arr34 = @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理 ",@"电脑操作员/打字员/校对",@"保安",@"合同管理"];
    NSArray * arr35 = @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师"];
    NSArray * arr36 = @[@"外贸/贸易经理/主管",@"外贸/贸易专员/助理",@"单证员",@"报关/报检/核销"];
    NSArray * arr37 = @[@"物流经理/主管",@"物流专员/助理",@"运输经理/主管",@"货运代理",@"快递员/配送员",@"理货员",@"司机",@"物流总监",@"仓库管理员"];
    NSArray * arr38 = @[@"采购经理/主管",@"采购专员/助理",@"供应商管理",@"材料/设备采购管理",@"采购总监",@"采购工程师"];
    NSArray * arr39 = @[@"计算机（IT）类"];
    NSArray * arr40 = @[@"翻译"];
    NSArray * arr41 = @[@"其他"];
    
    NSArray * objectArr = [NSArray arrayWithObjects:arr1,arr2,arr3,arr4,arr5,arr6,arr7,arr8,arr9,arr10,arr11,arr12,arr13,arr14,arr15,arr16,arr17,arr18,arr19,arr20,arr21,arr22,arr23,arr24,arr25,arr26,arr27,arr28,arr29,arr30,arr31,arr32,arr33,arr34,arr35,arr36,arr37,arr38,arr39,arr40,arr41,nil];
    
    return objectArr;

}


-(NSArray *)createArrThree4
{
    NSArray * arr = @[
                      @[@"结构工程师",@"建筑师/建筑设计师",@"规划师",@"电气工程师",@"给排水工程师",@"设备工程师",@"效果图制作/建筑制图",@"暖通工程师",@"审图工程师",@"土建工程师",@"施工员",@"建造师",@"现场管理员",@"工长",@"桩基工程师",@"加固工程师",@"资料员",@"取样员",@"钢筋翻样",@"土地整理及规划"],
                      @[@"总建筑师/高级建筑师",@"审图工程师",@"结构工程师",@"建筑师/建筑设计师",@"效果图制作/建筑制图",@"规划师",@"设备工程师",@"电气工程师",@"给排水工程师",@"暖通工程师"],
                      @[@"房地产开发/策划",@"建模人员",@"前期开发类",@"报建员",@"材料员",@"资料管理员"],
                      @[@"造价工程师",@"造价员/预算",@"招标代理工程师",@"招标代理人员",@"注册咨询工程师",@"土地估价师",@"资产评估师",@"房地产估价师",@"造价技术负责人"],
                      @[@"市政工程师",@"管道工程师 "],
                      @[@"路桥工程师",@"路基/路面工程师",@"隧道工程师",@"桥梁/桥涵工程师",@"铁道/地铁/轨道工程师",@"港口/航道/水运工程师",@"公路/桥梁设计师",@"线路/站场设计",@"沥青/养护人员",@"计量员/计量工程师"],
                      @[@"园林/景观设计师",@"园林/景观工程师",@"园艺工程师",@"园林绿化/养护",@"植物设计/配置",@"施工图设计师"],
                      @[@"水文地质工程",@"岩土工程师",@"钻井工程师",@"司钻/副司钻",@"采矿工程师/技术员"],
                      @[@"注册监理工程师",@"专业监理工程师",@"总监理工程师",@"监理员",@"注册设备监理工程师",@"总监理工程师代表",@"安全监理工程师",@"监理工程师"],
                      @[@"安装/水电工程师",@"空调工程师",@"机电工程师",@"机械工程师",@"无损检测",@"安装工程师",@"暖通设计师",@"制冷工程师",@"防腐保温",@"照明工程师"],
                      @[@"钢结构设计师",@"钢结构工程师",@"详图/拆图/深化",@"表面处理"],
                      @[@"测绘工程师",@"测量组长 ",@"测量员/技工",@"测绘内业/制图",@"航测遥感",@"GIS/GPS软件工程师",@"数据处理",@"产品技术支持/技术",@"物探工程师"],
                      @[@"装饰设计师",@"室内设计师",@"平面设计",@"幕墙设计师",@"家具设计师",@"门窗设计师",@"幕墙工程师"],
                      @[@"爆破工程师",@"爆破技术员/爆破员",@"征地/拆迁"],
                      @[@"试验室主任",@"试验检测工程师",@"试验检测员",@"质量管理员"],
                      @[@"工厂厂长/副厂长/工厂经理",@"生产经理/车间主任",@"生产计划/调度",@"生产主管/督导/领班",@"生产跟单/单证",@"设备工程师/设备维护",@"设备经理/主管",@"精益生产"],
                      @[@"项目总监",@"项目经理",@"项目主管",@"项目专员/助理",@"项目工程师"],
                      @[@"总工程师/副总工程"],
                      @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人",@"总裁/总经理/顾问",@"合约工程师"],
                      @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"售后服务"],
                      @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"企业文化/企划管理",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"员工关系/工会管理",@"其他人力资源类"],
                      @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理 ",@"电脑操作员/打字员/校对",@"保安",@"行政/秘书/文员",@"合同管理"],
                      @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师"],
                      @[@"韩语翻译",@"法语翻译",@"德语翻译",@"其他语种翻译",@"英语翻译",@"日语翻译"],
                      @[@"计算机类",@"硬件工程师"],
                      @[@"安全主任",@"安全工程师",@"安全员"],
                      @[@"消防设计",@"消防工程师",@"消防检测/维护",@"建筑智能化",@"弱电工程师",@"测试工程师",@"研发工程师"],
                      @[@"信号工程师",@"通信工程师",@"电子工程师/技术员"],
                      @[@"物业经理/主任/主管",@"物业管理师",@"助理物业管理师",@"物业顾问"],
                      @[@"应届毕业生/实习生",@"材料/设备采购管理",@"司机",@"其他"]
                      ];
    
    
    return arr;
    
}

-(NSArray*)createArrThree5
{
    NSArray * arr = @[
                      @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人"],
                        @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"促销员/导购",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"销售助理"],
                        @[@"市场总监",@"市场经理/主管",@"市场助理/专员 ",@"市场策划/企划",@"市场分析/调研",@"市场推广经理/主管",@"市场推广专员",@"产品/品牌经理",@"产品/品牌专员",@"促销督导经理/主管",@"会务经理/主管"],
                        @[@"总工程师/副总工程"],
                        @[@"研发部经理/技术主管"],
                        @[@"工艺工程师/工艺员"],
                        @[@"机械工程师"],
                        @[@"模具工程师"],
                        @[@"陶瓷设计师",@"陶瓷加工员",@"釉料技术",@"喷釉技术",@"陶瓷色料调色开发",@"仿古砖技术员",@"陶瓷印花/贴花",@"洁具/卫浴设计师",@"窑炉工程师/技术员"],
                        @[@"采矿工程师/技术员",@"土建工程师/基建工程师",@"结构工程师",@"注册监理工程师",@"造价员/预算",@"造价工程师",@"机械绘图师",@"机电工程师",@"电气工程师/技术员",@"磨操作员",@"窑操作员",@"余热发电",@"实验室负责人/工程师",@"实验员",@"化验室主任/品质主管",@"中控室主任/值班长",@"搅拌站站长",@"现场/施工管理"],
                        @[@"平面设计师",@"家具设计师",@"林业员",@"种植技术"],
                        @[@"挤出/注塑技术员"],
                        @[@"项目总监",@"项目经理",@"项目主管",@"项目专员/助理",@"项目工程师"],
                        @[@"工厂厂长/副厂长/工厂经理",@"生产经理/车间主任",@"生产计划/调度",@"生产主管/督导/领班",@"生产跟单/单证",@"设备工程师/设备维护",@"设备经理/主管",@"精益生产"],
                        @[@"品质经理/主管(QA/QC经理/主管)",@"品质工程师(QA/QC工程师)",@"化验/检验/质检/测试员",@"体系/认证工程师/审核员（ISO等）",@"安全/健康/环境"],
                        @[@"客服经理/主管（非技术）",@"客服专员/助理（非技术）",@"技术支持经理/主管",@"产品技术支持/技术",@"售后服务",@"客服总监",@"咨询热线/呼叫中心服务人员"],
                        @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"企业文化/企划管理",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"员工关系/工会管理",@"其他人力资源类"],
                        @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理 ",@"电脑操作员/打字员/校对",@"保安",@"合同管理" ],
                        @[@"采购总监",@"采购经理/主管",@"采购专员/助理",@"供应商管理",@"材料/设备采购管理",@"采购工程师" ],
                        @[@"外贸/贸易经理/主管",@"外贸/贸易专员/助理",@"单证员",@"报关/报检/核销"],
                        @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师"],
                        @[@"物流总监",@"物流经理/主管",@"物流专员/助理",@"运输经理/主管",@"货运代理",@"快递员/配送员",@"理货员",@"仓库管理员",@"司机"],
                        @[@"钳工",@"线切割工",@"车/铣/刨/磨/镗工",@"钻/冲工",@"钣金工",@"电火花工",@"雕刻工",@"电工",@"操作工",@"装配工",@"抛光工",@"焊工/铆工",@"维修工",@"打磨工",@"锣工",@"油漆工",@"模具工",@"铲刮工",@"行车工",@"模具维修",@"喷漆工",@"水工/木工/油漆工",@"其它技工"]
                      ];
    
    return arr;
}

-(NSArray*)createArrThree6
{
    NSArray * arr = @[
                      @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人"],
                      @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"销售助理"],
                      @[@"外贸/贸易经理/主管",@"外贸/贸易专员/助理",@"单证员",@"报关/报检/核销"],
                      @[@"项目总监",@"项目经理",@"项目主管",@"项目专员/助理",@"项目工程师"],
                      @[@"印刷机长/助手"],
                      @[@"印刷排版/制版专员"],
                      @[@"印刷工程师/技师"],
                      @[@"调墨技师"],
                      @[@"包装工程师"],
                      @[@"包装设计"],
                      @[@"注塑/吹塑工程师"],
                      @[@"制袋/切袋"],
                      @[@"防伪设计"],
                      @[@"复合/涂布/扫描"],
                      @[@"烫金/模切"],
                      @[@"文字录入/排版"],
                      @[@"晒版/装订"],
                      @[@"平面设计师"],
                      @[@"工厂厂长/副厂长/工厂经理",@"生产经理/车间主任",@"生产计划/调度",@"生产主管/督导/领班",@"生产跟单/单证",@"设备工程师/设备维护",@"设备经理/主管",@"精益生产"],
                      @[@"品质经理/主管(QA/QC经理/主管)",@"品质工程师(QA/QC工程师)",@"化验/检验/质检/测试员",@"体系/认证工程师/审核员（ISO等）",@"安全/健康/环境"],
                      @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"企业文化/企划管理",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"员工关系/工会管理",@"其他人力资源类"],
                      @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理",@"电脑操作员/打字员/校对",@"保安",@"合同管理"],
                      @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师"],
                      @[@"物流经理/主管",@"物流专员/助理",@"运输经理/主管",@"货运代理",@"快递员/配送员",@"理货员",@"司机",@"物流总监",@"仓库管理员"],
                      @[@"机修工",@"钳工",@"线切割工",@"车/铣/刨/磨/镗工",@"钻/冲工",@"钣金工",@"电火花工",@"雕刻工",@"电工",@"操作工",@"装配工",@"抛光工",@"焊工/铆工",@"维修工",@"打磨工",@"锣工",@"油漆工",@"机床修理工",@"模具工",@"铲刮工",@"折弯工",@"行车工",@"拉钢工",@"浇钢工",@"模具维修",@"喷漆工",@"其它技工"],
                      @[@"其他"]

                      ];
    
    return arr;
}


-(NSArray *)createArrThree7
{
    NSArray * arr = @[
                      @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人"],
                      @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"促销员/导购",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"销售助理"],
                      @[@"客服经理/主管（非技术）",@"客服专员/助理（非技术）",@"技术支持经理/主管",@"产品技术支持/技术",@"售后服务",@"客服总监",@"咨询热线/呼叫中心服务人员"],
                      @[@"项目总监",@"项目经理",@"项目主管",@"项目专员/助理",@"项目工程师"],
                      @[@"矿长/副矿长"],
                      @[@"总工程师/副总工程"],
                      @[@"研发工程师"],
                      @[@"炼钢工程师",@"冶金工程师",@"冶炼工程师",@"金属材料/压力加工",@"炉窑技术",@"耐火材料",@"烧结工程师",@"球团工程师",@"酸洗/退火",@"焦化工程师",@"高炉技术",@"热风炉技术",@"转炉",@"电炉",@"轧钢工艺",@"热轧",@"冷轧",@"加热炉",@"制管工程师",@"管道工程师 ",@"热处理工程师/技术员"],
                      @[@"采矿工程师/技术员",@"地质工程师",@"选矿工程师/技术员",@"通风工程师/技术员",@"矿建/井建工程师",@"矿权评估",@"矿物分析/化验",@"测绘工程师",@"测量员/技工",@"钻探工程师",@"水文地质工程"],
                      @[@"选煤设计",@"选煤/洗煤",@"水煤浆",@"喷煤技术",@"煤质分析/化验",@"煤型加工",@"煤气化",@"煤焦化/炼焦",@"煤化油",@"煤化工工程师",@"煤化工",@"煤层气",@"采煤掘进",@"井下支护",@"瓦检员"],
                      @[@"铜加工",@"精炼炉",@"熔铸工程师",@"氧化工程师/技术员",@"电解工程师/技术员",@"幕墙设计师"],
                      @[@"建筑工程师",@"建造师",@"土建工程师/基建工程师",@"监理工程师",@"造价工程师",@"造价员/预算",@"现场/施工管理"],
                      @[@"电气工程师/技术员"],
                      @[@"环保工程师/技术员",@"给排水工程师",@"安全工程师",@"水处理",@"安全员"],
                      @[@"机械工程师",@"模具工程师",@"机电工程师",@"铸造/锻造工程师",@"冲压工程师/技师",@"仪表/计量工程师",@"机械绘图师",@"工艺工程师/工艺员",@"焊接工程师",@"机械设计工程师",@"制造工程师"],
                      @[@"工厂厂长/副厂长/工厂经理",@"生产经理/车间主任",@"生产计划/调度",@"生产主管/督导/领班",@"生产跟单/单证",@"设备工程师/设备维护",@"设备经理/主管",@"精益生产"],
                      @[@"品质经理/主管(QA/QC经理/主管)",@"品质工程师(QA/QC工程师)",@"化验/检验/质检/测试员",@"体系/认证工程师/审核员（ISO等）"],
                      @[@"钳工",@"机修工",@"线切割工",@"车/铣/刨/磨/镗工",@"钻/冲工",@"钣金工",@"电工",@"操作工",@"装配工",@"焊工/铆工",@"维修工",@"模具工",@"其它技工"],
                      @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"企业文化/企划管理",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"员工关系/工会管理",@"其他人力资源类"],
                      @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理 ",@"电脑操作员/打字员/校对",@"保安",@"合同管理"],
                      @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师"],
                      @[@"采购经理/主管",@"采购专员/助理",@"供应商管理",@"材料/设备采购管理",@"采购总监",@"采购工程师"],
                      @[@"外贸/贸易经理/主管",@"外贸/贸易专员/助理",@"单证员",@"报关/报检/核销"],
                      @[@"物流经理/主管",@"物流专员/助理",@"运输经理/主管",@"货运代理",@"快递员/配送员",@"理货员",@"司机",@"物流总监",@"仓库管理员"],
                      @[@"韩语翻译",@"法语翻译",@"德语翻译",@"其他语种翻译",@"英语翻译",@"日语翻译"],
                      @[@"应届毕业生/实习生"],
                      @[@"其他"]
                      ];
    return arr;
}


-(NSArray * )createArrThree8
{
    NSArray * arr = @[
                      @[@"环保工程师/技术员"],
                      @[@"水处理工程师"],
                      @[@"工艺工程师/工艺员"],
                      @[@"工程部经理"],
                      @[@"总经理/总裁/首席执行官CEO",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"合伙人",@"总经理助理/总裁助理/董事会秘书",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"生产经理/车间主任",@"副总经理/副总裁/首席运营官COO"],
                      @[@"项目总监",@"项目经理",@"项目主管",@"项目专员/助理"],
                      @[@"脱硫除尘工程师",@"烟气脱硫工艺",@"除尘设计",@"脱硝工艺工程师"],
                      @[@"废水/污水处理",@"净水/纯水处理",@"环评工程师/技术员",@"固废/垃圾处理",@"清洁生产审核",@"水处理药剂师",@"循环冷却水处理",@"海水淡化",@"非标设计",@"噪声治理工程师/技术员",@"环境在线监测",@"废气治理",@"沼气工程师",@"室内空气治理",@"水质分析/化验",@"中水回用",@"膜处理",@"环境检测",@"研发工程师"],
                      @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"销售助理"],
                      @[@"给排水工程师"],
                      @[@"研发部经理/技术主管",@"总工程师/副总工程"],
                      @[@"运营管理",@"现场/施工管理",@"现场工程师",@"安装员/调试员"],
                      @[@"热能工程师",@"机务工程师",@"热控工程师",@"弱电工程师",@"水利工程师",@"水土保持监测",@"锅炉工程师/技师",@"汽机工程师",@"电气工程师/技术员"],
                      @[@"工厂厂长/副厂长/工厂经理",@"生产经理/车间主任",@"生产计划/调度",@"生产主管/督导/领班",@"生产跟单/单证",@"设备工程师/设备维护",@"设备经理/主管",@"精益生产"],
                      @[@"品质经理/主管(QA/QC经理/主管)",@"品质工程师(QA/QC工程师)",@"化验/检验/质检/测试员",@"体系/认证工程师/审核员（ISO等）",@"安全/健康/环境"],
                      @[@"仪器/仪表",@"机械工程师",@"CAD制图",@"机电工程师",@"设备工程师/设备维护"],
                      @[@"土建工程师/基建工程师",@"结构工程师",@"造价工程师",@"造价员/预算",@"监理工程师",@"园林/景观",@"注册咨询工程师",@"招投标人员",@"测绘工程师",@"建筑工程师",@"建造师",@"市政工程师"],
                      @[@"市场总监",@"市场经理/主管",@"市场助理/专员 ",@"市场策划/企划",@"市场分析/调研",@"市场推广经理/主管",@"市场推广专员",@"产品/品牌经理",@"产品/品牌专员",@"会务经理/主管",@"促销督导经理/主管"],
                      @[@"化工工程师/技术员",@"安评工程师/技术员",@"防腐保温",@"安全工程师",@"暖通工程师",@"自动控制工程师/技术员"],
                      @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"员工关系/工会管理",@"其他人力资源类"],
                      @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理 ",@"电脑操作员/打字员/校对",@"保安",@"合同管理"],
                      @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师"],
                      @[@"物流经理/主管",@"物流专员/助理",@"运输经理/主管",@"货运代理",@"快递员/配送员",@"司机",@"物流总监",@"仓库管理员",@"采购经理/主管",@"采购专员/助理",@"供应商管理",@"材料/设备采购管理",@"采购总监",@"采购工程师"],
                      @[@"系统/网络管理",@"软件工程师",@"平面设计"],
                      @[@"英语翻译",@"日语翻译",@"韩语翻译",@"德语翻译",@"法语翻译",@"其他语种翻译"],
                      @[@"钳工",@"车/铣/刨/磨/镗工",@"钣金工",@"电工",@"焊工/铆工",@"油漆工",@"操作工",@"其它技工"],
                      @[@"应届毕业生/实习生"],
                      @[@"客服经理/主管（非技术）",@"客服专员/助理（非技术）",@"技术支持经理/主管",@"售后服务",@"产品技术支持/技术"],
                      @[@"其他"]
                      ];
    
    return arr;
}

-(NSArray*)createArrThree9
{
    NSArray * arr = @[
                      @[@"司机"],
                      @[@"播音员/主持人"],
                      @[@"工程技术人员"],
                      @[@"网络交易员 "],
                      @[@"美导"],
                      @[@"商务主管/商务人员"],
                      @[@"收银主管"],
                      @[@"售货员"],
                      @[@"工程部"],
                      @[@"经营/企划/管理类"],
                      @[@"店长/卖场经理/楼面经理"],
                      @[@"编辑"],
                      @[@"美容师"],
                      @[@"翻译"],
                      @[@"理货员"],
                      @[@"质量管理/验货员(QA/QC)"],
                      @[@"促销员/导购"],
                      @[@"记者"],
                      @[@"收银员"],
                      @[@"报关/报检/核销"],
                      @[@"文职"],
                      @[@"行政总监"],
                      @[@"经理"],
                      @[@"外贸助理"],
                      @[@"其他"]
                      ];
    return arr;
}


-(NSArray*)createArrThree10
{
    NSArray * arr = @[
                      @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人"],
                      @[@"证券分析师"],
                      @[@"投融资经理/主管",@"项目经理",@"证券/期货/外汇经纪人",@"股票/期货操盘手",@"拍卖师",@"研究员/分析人士",@"交易员/开户员",@"期货分析师",@"风控经理/主管",@"风控专员"],
                      @[@"行长/副行长",@"资产评估/分析",@"信贷管理",@"风险管理",@"保险代理/经纪人/客户经理",@"保险核保",@"保险理赔",@"银行柜员"],
                      @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师",@"监察稽核/法律"],
                      @[@"咨询经理",@"投资/理财顾问",@"理财分析师",@"法律顾问",@"咨询员",@"调研员",@"培训师"],
                      @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"企业文化/企划管理",@"员工关系/工会管理",@"其他人力资源类"],
                      @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理 ",@"电脑操作员/打字员/校对",@"合同管理",@"保安",@"客服专员/助理（非技术）",@"行政/人事/文职/后勤",@"网络工程师"],
                      @[@"韩语翻译",@"法语翻译",@"德语翻译",@"其他语种翻译",@"英语翻译",@"日语翻译"],
                      @[@"应届毕业生/实习生"],
                      @[@"其他"]
                      ];
    return arr;
}

-(NSArray*)createArrThree11
{
    NSArray * arr = @[
                      @[@"专科医生",@"牙科医生",@"麻醉医生",@"皮肤科",@"X射线诊断",@"化疗科",@"五官科",@"神经外科",@"妇科",@"骨科",@"中西医结合医师",@"男科",@"急诊科",@"导医",@"检验士（师）",@"B超及彩超医师",@"营养师",@"药库主任/药剂师",@"妇产科医师"],
                      @[@"院长",@"副院长",@"医务科长",@"医院管理人员",@"院长代理",@"医学专家顾问",@"医务部负责人",@"护理部负责人",@"院办主任",@"护理主任/护士长",@"护士/护理人员",@"儿童口腔科主任",@"护理（助产士）",@"行政经理/主管/办公室主任",@"财务/会计助理",@"网络工程师",@"保安"],
                      @[@"胃镜",@"消毒技术",@"腹部超声技术",@"心脏超声技术",@"CT室技师",@"公共卫生/疾病控制",@"医药学检验",@"心电图"],
                      @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人"],
                      @[@"有机合成研发人员",@"医药研发人员",@"药物制剂工程师/技术员",@"原料药工程师/技术员",@"医药合成工程师/技术员",@"医药研发管理人员",@"药品注册/申报",@"研发分析人员"],
                      @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"促销员/导购",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"城市经理",@"销售助理"],
                      @[@"工厂厂长/副厂长/工厂经理",@"生产经理/车间主任",@"生产计划/调度",@"生产主管/督导/领班",@"生产跟单/单证",@"工艺工程师/工艺员",@"精益生产"],
                      @[@"生物工程/生物制药",@"研发助理",@"试剂研发人员",@"实验员"],
                      @[@"店长",@"执业药师/驻店药师",@"收银员",@"店员/营业员"],
                      @[@"化学分析工程师",@"化工工程师/技术员",@"精细化工工程师",@"无机化工工程师",@"配方工程师"],
                      @[@"品质经理/主管(QA/QC经理/主管)",@"品质工程师(QA/QC工程师)",@"化验/检验/质检/测试员",@"体系/认证工程师/审核员（ISO等）",@"安全/健康/环境"],
                      @[@"设备工程师/设备维护",@"设备经理/主管"],
                      @[@"美容整形师"],
                      @[@"心理医生"],
                      @[@"兽医"],
                      @[@"其他"]
                      ];
    return arr;
}

-(NSArray *)createArrThree12
{
    NSArray * arr = @[
                      @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人"],
                      @[@"高级硬件工程师"],
                      @[@"硬件工程师"],
                      @[@"软件工程师"],
                      @[@"品质经理/主管(QA/QC经理/主管)"],
                      @[@"ERP技术/开发应用"],
                      @[@"系统集成工程师"],
                      @[@"系统分析员"],
                      @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"促销员/导购",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"城市经理",@"销售助理"],
                      @[@"系统工程师"],
                      @[@"教员/老师"],
                      @[@"技术专员"],
                      @[@"部门经理/主管"],
                      @[@"秘书/高级文员"],
                      @[@"首席技术官CTO/首席信息官CIO"],
                      @[@"技术支持经理/主管"],
                      @[@"项目专员/助理"],
                      @[@"总监/事业部总经理/运营主管"],
                      @[@"研发部经理/技术主管"],
                      @[@"产品技术支持/技术"],
                      @[@"数据库开发工程师"],
                      @[@"网页设计师"],
                      @[@"信息技术专员"],
                      @[@"计量工程师"],
                      @[@"标准化工程师"],
                      @[@"计算机辅助设计工程师"],
                      @[@"系统测试"],
                      @[@"软件测试"],
                      @[@"硬件测试"],
                      @[@"测试员"],
                      @[@"系统架构设计师"],
                      @[@"程序员"],
                      @[@"项目总监"],
                      @[@"设计人员"],
                      @[@"IT工程师"],
                      @[@"项目主管"],
                      @[@"项目经理"],
                      @[@"其他"],
                      @[@"php工程师"],
                      @[@"php网站开发工程师"],
                      @[@"php软件开发工程师"],
                      @[@"php高级程序员"],
                      @[@"php高级开发工程师"],
                      @[@"php高级工程师"],
                      @[@"Php软件工程师"],
                      @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"企业文化/企划管理",@"员工关系/工会管理",@"职业规划师",@"职业指导师",@"职业咨询师",@"其他人力资源类"],
                      @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理 ",@"电脑操作员/打字员/校对",@"合同管理",@"保安"],
                      @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师"]
                      ];
    return arr;
}

-(NSArray*)createArrThree13
{
    NSArray * arr = @[
                      @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人",@"场长",@"项目经理",@"基地主管/经理"],
                      @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"销售助理",@"售后服务",@"客户服务"],
                      @[@"技术总监",@"研发部经理/技术主管",@"研发工程师",@"农化服务",@"农艺师",@"农业技术员",@"育种员",@"种植技术",@"植保专员",@"苗木主管/技术员",@"植物设计/配置",@"配方工程师",@"园艺工程师",@"食品工程师",@"兽医",@"动保研发",@"饲养员",@"养殖工程师/技术员",@"园林绿化/养护",@"制剂师",@"机械工程师",@"温室技术"],
                      @[@"品质经理/主管(QA/QC经理/主管)",@"品质工程师(QA/QC工程师)",@"化验/检验/质检/测试员",@"体系/认证工程师/审核员（ISO等）",@"安全/健康/环境"],
                      @[@"工厂厂长/副厂长/工厂经理",@"生产经理/车间主任",@"生产计划/调度",@"生产主管/督导/领班",@"生产跟单/单证",@"设备工程师/设备维护",@"设备经理/主管",@"精益生产",@"施工员",@"生产技术员"],
                      @[@"市场总监",@"市场经理/主管",@"市场助理/专员 ",@"市场策划/企划",@"市场分析/调研",@"市场推广经理/主管",@"市场推广专员",@"产品/品牌经理",@"产品/品牌专员",@"会务经理/主管",@"促销督导经理/主管"],
                      @[@"客服经理/主管（非技术）",@"客服专员/助理（非技术）",@"技术支持经理/主管",@"产品技术支持/技术",@"售后服务",@"客服总监",@"咨询热线/呼叫中心服务人员"],
                      @[@"外贸/贸易经理/主管",@"外贸/贸易专员/助理",@"外贸跟单",@"国内贸易人员",@"单证员",@"报关/报检/核销"],
                      @[@"采购经理/主管",@"采购专员/助理",@"供应商管理",@"材料/设备采购管理",@"采购总监",@"采购工程师"],
                      @[@"物流经理/主管",@"物流专员/助理",@"运输经理/主管",@"货运代理",@"快递员/配送员",@"理货员",@"司机",@"物流总监",@"仓库管理员",@"仓库主管"],
                      @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"企业文化/企划管理",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"员工关系/工会管理",@"其他人力资源类"],
                      @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理 ",@"电脑操作员/打字员/校对",@"保安",@"合同管理"],
                      @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师"],
                      @[@"机修工",@"钳工",@"线切割工",@"车/铣/刨/磨/镗工",@"钻/冲工",@"钣金工",@"电工",@"操作工",@"装配工",@"焊工/铆工",@"维修工",@"模具工",@"水工/木工/油漆工",@"其它技工"],
                      @[@"其他"]
                      ];
    return arr;
}

-(NSArray*)createArrThree14
{
    NSArray * arr = @[
                      @[@"客户代表",@"客户经理",@"客户总监（AD）",@"客服专员/助理（非技术）",@"销售代表/营销经理",@"销售经理/销售主管",@"业务员/推销员",@"客户经理/主管",@"渠道/分销/拓展/招商",@"市场助理/专员 "],
                      @[@"平面设计",@"网页设计师",@"资深设计师",@"广告创意/设计主管/专员",@"创意/设计经理",@"创意/设计总监",@"美术指导"],
                      @[@"策划经理",@"文案/策划",@"文案策划/编辑",@"高级文案",@"市场/策划总监"],
                      @[@"公关媒介经理/主管",@"公关媒介专员",@"公关媒介策划",@"公关媒介执行",@"公关/媒介助理",@"媒介销售",@"媒介购买",@"媒介经理/专员",@"媒介总监",@"电子商务专员",@"秘书/助理/会计/商务专员",@"会务经理",@"项目经理",@"会务主管",@"会务专员"],
                      @[@"编剧",@"网站编辑",@"导演/编导",@"采编",@"作家/撰稿人",@"记者"],
                      @[@"影视策划/制作人员",@"后期制作",@"包装工程师",@"动漫制作"],
                      @[@"发行员/业务员",@"出版/发行",@"发行部经理、主管"],
                      @[@"节目经纪人",@"经纪人/星探",@"播音员/主持人",@"演员/模特/主持人",@"时装秀/模特",@"服装/试衣模特",@"演唱歌手"],
                      @[@"文员/前台/接待",@"社长",@"区域经理",@"部门主任/主管",@"副社长",@"人事主管",@"行政/人事/文职/后勤",@"人事经理/专员",@"出纳",@"会计",@"财务经理",@"财务总监",@"秘书/高级文员",@"司机",@"电工",@"程序员",@"开发工程师"],
                      @[@"化妆师/造型师",@"特效师",@"音效师",@"摄影师",@"配音师/录音师",@"配音员",@"电视编导、摄像",@"其他"]
                      ];
    return arr;
}

-(NSArray*)createArrThree15
{
    NSArray * arr = @[
                      @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人"],
                      @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"销售助理"],
                      @[@"工厂厂长/副厂长/工厂经理",@"生产经理/车间主任",@"生产计划/调度",@"生产主管/督导/领班",@"生产跟单/单证",@"设备工程师/设备维护",@"设备经理/主管",@"精益生产"],
                      @[@"机械工程师"],
                      @[@"平面设计师"],
                      @[@"电气工程师"],
                      @[@"软件工程师"],
                      @[@"服装/纺织设计",@"皮革设计师",@"面料辅料开发",@"织造/染色/定型/印花",@"服装打样/制版",@"纸样师/车板工",@"裁剪车缝熨烫",@"设计总监",@"高级设计师",@"打样师",@"家纺设计师"],
                      @[@"品质经理/主管(QA/QC经理/主管)",@"品质工程师(QA/QC工程师)",@"化验/检验/质检/测试员",@"体系/认证工程师/审核员（ISO等）",@"安全/健康/环境"],
                      @[@"店员/营业员"],
                      @[@"市场总监",@"市场经理/主管",@"市场助理/专员 ",@"市场策划/企划",@"市场分析/调研",@"市场推广经理/主管",@"市场推广专员",@"产品/品牌经理",@"产品/品牌专员",@"会务经理/主管",@"促销督导经理/主管"],
                      @[@"钳工",@"车/铣/刨/磨/镗工",@"钻/冲工",@"雕刻工",@"电工",@"操作工",@"焊工/铆工",@"维修工",@"其它技工"],
                      @[@"客服经理/主管（非技术）",@"客服专员/助理（非技术）",@"技术支持经理/主管",@"产品技术支持/技术",@"售后服务",@"客服总监",@"咨询热线/呼叫中心服务人员"],
                      @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"企业文化/企划管理",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"员工关系/工会管理",@"其他人力资源类"],
                      @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理 ",@"电脑操作员/打字员/校对",@"保安",@"合同管理"],
                      @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师"],
                      @[@"外贸/贸易经理/主管",@"外贸/贸易专员/助理",@"单证员",@"报关/报检/核销"],
                      @[@"采购经理/主管",@"采购专员/助理",@"供应商管理",@"材料/设备采购管理",@"采购总监",@"采购工程师"],
                      @[@"物流经理/主管",@"物流专员/助理",@"运输经理/主管",@"货运代理",@"快递员/配送员",@"理货员",@"司机",@"物流总监",@"仓库管理员"],
                      @[@"韩语翻译",@"法语翻译",@"德语翻译",@"其他语种翻译",@"英语翻译",@"日语翻译"],
                      @[@"其他"]
                      ];
    return arr;
}

-(NSArray*)createArrThree16
{
    NSArray * arr = @[
                      @[@"总经理/总裁/首席执行官CEO",@"工厂厂长/副厂长/工厂经理",@"生产经理/车间主任",@"生产计划/调度",@"生产主管/督导/领班",@"生产跟单/单证",@"设备工程师/设备维护",@"设备经理/主管",@"精益生产"],
                      @[@"销售总监",@"大客户经理",@"销售代表/客户经理",@"销售经理/销售主管",@"销售助理",@"区域经理",@"促销员/导购",@"业务员/推销员"],
                      @[@"品质经理/主管(QA/QC经理/主管)",@"品质工程师(QA/QC工程师)",@"化验/检验/质检/测试员",@"体系/认证工程师/审核员（ISO等）",@"安全/健康/环境",@"物控/资材/物料/pmc",@"文控文员/工程师",@"流程管理",@"品质管理"],
                      @[@"研发工程师",@"研发助理",@"设计师",@"工程师",@"系统/网络管理",@"IT工程师",@"电气工程师/技术员",@"防伪设计",@"平面设计",@"技术员"],
                      @[@"市场总监",@"市场经理/主管",@"市场助理/专员 ",@"市场策划/企划",@"市场分析/调研",@"市场推广经理/主管",@"市场推广专员",@"产品/品牌经理",@"产品/品牌专员",@"促销督导经理/主管",@"会务经理/主管",@"店长/卖场经理/楼面经理",@"店员/营业员"],
                      @[@"食品技术研发",@"食品化学与分析",@"食品加工工艺",@"食品调配",@"食品贮运与保鲜",@"食品认证",@"食品调味师"],
                      @[@"渠道管理"],
                      @[@"总经理助理/总裁助理/董事会秘书",@"人力资源总监",@"人力资源专员/助理",@"人事主管",@"人事经理/专员",@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理 ",@"电脑操作员/打字员/校对",@"合同管理",@"保安",@"司机",@"厨师"],
                      @[@"机械工程师",@"模具工程师",@"机电工程师",@"仪表/计量工程师",@"机械设计工程师",@"制造工程师"],
                      @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"会计",@"审计",@"出纳",@"统计员"],
                      @[@"物流经理/主管",@"物流专员/助理",@"运输经理/主管",@"货运代理",@"快递员/配送员",@"理货员",@"仓库管理员",@"采购经理/主管",@"采购专员/助理",@"采购工程师"],
                      @[@"电工",@"操作工",@"装配工",@"维修工",@"模具工",@"服务员",@"包装工人",@"普工",@"其它技工"],
                      @[@"咨客"],
                      @[@"储备干部"],
                      @[@"翻译"],
                      @[@"其他"]
                      ];
    return arr;
}

-(NSArray*)createArrThree17
{
    NSArray * arr = @[
                      @[@"物流总监"],
                      @[@"物流经理/主管"],
                      @[@"物流专员/助理"],
                      @[@"运输经理/主管"],
                      @[@"货运代理"],
                      @[@"快递员/速递员"],
                      @[@"仓库/物料管理"],
                      @[@"船务/空运/陆运操作"],
                      @[@"司机"],
                      @[@"理货员"],
                      @[@"调度员"],
                      @[@"供应链管理"],
                      @[@"集装箱业务"],
                      @[@"海关事务管理"],
                      @[@"外贸/贸易经理/主管",@"外贸/贸易专员/助理",@"外贸跟单",@"国内贸易人员",@"单证员",@"报关/报检/核销"],
                      @[@"采购总监",@"采购经理/主管",@"采购专员/助理",@"供应商管理",@"材料/设备采购管理",@"采购工程师"],
                      @[@"总经理/总裁/首席执行官CEO",@"副总经理/副总裁/首席运营官COO",@"总经理助理/总裁助理/董事会秘书",@"总监/事业部总经理/运营主管",@"办事处/分公司/分支机构经理",@"首席技术官CTO/首席信息官CIO",@"首席财务官CFO",@"合伙人"],
                      @[@"销售总监",@"销售经理/销售主管",@"区域销售经理",@"销售代表/客户经理",@"销售工程师",@"电话销售",@"业务员/推销员",@"促销员/导购",@"销售行政",@"大客户经理",@"商务主管/商务人员",@"渠道/分销/拓展/招商",@"团购",@"城市经理",@"销售助理"],
                      @[@"人力资源总监",@"人力资源经理/主管",@"人力资源专员/助理",@"人事经理/专员",@"招聘经理/主管",@"招聘专员/助理",@"培训经理/主管",@"培训专员/助理/培训师",@"薪酬经理/主管",@"薪酬专员/助理",@"绩效经理/主管",@"绩效专员/助理",@"企业文化/企划管理",@"员工关系/工会管理",@"其他人力资源类"],
                      @[@"行政总监",@"行政经理/主管/办公室主任",@"行政专员/助理",@"秘书/高级文员",@"文员/前台/接待",@"图书情报/资料/文档管理 ",@"电脑操作员/打字员/校对",@"合同管理",@"保安"],
                      @[@"市场总监",@"市场经理/主管",@"市场助理/专员 ",@"市场策划/企划",@"市场分析/调研",@"市场推广经理/主管",@"市场推广专员",@"产品/品牌经理",@"产品/品牌专员",@"促销督导经理/主管",@"会务经理/主管"],
                      @[@"客服经理/主管（非技术）",@"客服专员/助理（非技术）",@"技术支持经理/主管",@"产品技术支持/技术",@"售后服务",@"客服总监",@"咨询热线/呼叫中心服务人员",@"客户关系/客户培训",@"客户投诉受理/监控"],
                      @[@"其他"],
                      @[@"财务总监",@"财务主管/总帐主管",@"财务/会计助理",@"注册会计师",@"会计",@"注册审计师",@"审计",@"出纳",@"统计员",@"税务经理/税务主管",@"税务专员/助理",@"注册税务师",@"投融资经理/主管",@"成本经理/成本主管",@"财务分析",@"资产评估师"]
                      ];
    
    return arr;
}

-(NSArray*)createArrThree18
{
    NSArray * arr = @[
                      @[@"计调"],
                      @[@"导游/旅行顾问"],
                      @[@"旅游操作师"],
                      @[@"外联销售"],
                      @[@"前厅部员工",@"前厅部经理"],
                      @[@"客房部员工"],
                      @[@"餐饮/娱乐管理",@"酒店/宾馆营销",@"酒店/宾馆经理",@"大堂经理",@"客房服务员/楼面服务员",@"领班",@"服务员",@"订票/订房服务",@"导游/旅行顾问",@"礼仪/迎宾",@"行政主厨/厨师长",@"厨师/面点师",@"调酒师",@"茶艺师"],
                      @[@"预定/票务人员"],
                      @[@"销售经理/销售主管"],
                      @[@"行政/人事/文职/后勤"],
                      @[@"签证专员"],
                      @[@"文员/前台/接待"],
                      @[@"业务员/推销员"],
                      @[@"市场助理/专员 "],
                      @[@"市场经理/主管"],
                      @[@"翻译"],
                      @[@"司机"],
                      @[@"其他"]
                      ];
    return arr;
}



- (id)initWithNibName:(NSString *)nibNameOrNil bundle:(NSBundle *)nibBundleOrNil
{
    self = [super initWithNibName:nibNameOrNil bundle:nibBundleOrNil];
    if (self) {
        // Custom initialization
    }
    return self;
}

- (void)viewDidLoad
{
    [super viewDidLoad];
//    self.navigationItem.title =@"行业/职业";
    [self setNavTitle:@"行业/职业"];
    
    // Do any additional setup after loading the view from its nib.
}

- (void)didReceiveMemoryWarning
{
    [super didReceiveMemoryWarning];
    // Dispose of any resources that can be recreated.
}

-(void)updateCom:(RequestCon *)con
{
    if (type_ == 2) {
        [self createArr1];
        zyArr_ = [NSArray arrayWithArray:[object1Arr_ objectAtIndex:index_]];
    }
    if (type_ == 3) {
        [self createObjectArr2];
        zyArr_ = [NSArray arrayWithArray:[[object2Arr_ objectAtIndex:index_] objectAtIndex:index2_]];
    }
    
    
    [tableView_ reloadData];
}

-(void)beginLoad:(id)dataModal exParam:(id)exParam
{
    
    [self updateCom:nil];
}

#pragma UITableViewDataSource
-(NSInteger)tableView:(UITableView *)tableView numberOfRowsInSection:(NSInteger)section
{
    return [zyArr_ count];
}


-(UITableViewCell*)tableView:(UITableView *)tableView cellForRowAtIndexPath:(NSIndexPath *)indexPath
{
    static NSString *CellIdentifier =@"Cell";
    
    UITableViewCell *cell = (UITableViewCell*)[tableView dequeueReusableCellWithIdentifier:CellIdentifier];
    if (cell == nil) {
        
        cell = [[UITableViewCell alloc] initWithStyle:UITableViewCellStyleDefault reuseIdentifier:CellIdentifier];
        
        [cell setAccessoryType:UITableViewCellAccessoryDisclosureIndicator];
    }
    NSString * str  = @"";
   
    str =[zyArr_ objectAtIndex:indexPath.row];
    
    cell.textLabel.text = str;
    
    return cell;
    
}

-(void)loadDetail:(id)selectData exParam:(id)exParam indexPath:(NSIndexPath *)indexPath
{
    if (type_ == 2) {
        UserZYListCtl * threeLevelCtl = [[UserZYListCtl alloc] init];
        threeLevelCtl.type_ = 3;
        threeLevelCtl.delegate_ = self;
        [self.navigationController pushViewController:threeLevelCtl animated:YES];
        threeLevelCtl.index_ = index_;
        threeLevelCtl.index2_ = indexPath.row;
        [threeLevelCtl beginLoad:nil exParam:nil];
        
    }
    if (type_ == 3) {
        [self.navigationController popViewControllerAnimated:NO];
        [delegate_ chooseZy:[zyArr_ objectAtIndex:indexPath.row]];
    }
    
}


#pragma choosezydelegate
-(void)chooseZy:(NSString *)zyeStr
{
    [self.navigationController popViewControllerAnimated:NO];
    [delegate_ chooseZy:zyeStr];
}


@end
